In [1]:
import pandas as pd
import numpy as np

In [8]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Pichhei','julee','venesa','aptana','surine','niva'],
        'Sales':[4000,9000,2000,4000,5000,6000]}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

  Company   Person  Sales
0    GOOG  Pichhei   4000
1    GOOG    julee   9000
2    MSFT   venesa   2000
3    MSFT   aptana   4000
4      FB   surine   5000
5      FB     niva   6000

In [11]:
df.groupby('Company')

In [12]:
bycomp = df.groupby('Company')

In [13]:
bycomp.mean()

         Sales
Company
FB        5500
GOOG      6500
MSFT      3000

In [14]:
bycomp.sum()

         Sales
Company
FB       11000
GOOG     13000
MSFT      6000

In [15]:
bycomp.std()

               Sales
Company
FB        707.106781
GOOG     3535.533906
MSFT     1414.213562

In [16]:
bycomp.sum().loc['GOOG']

Sales    13000
Name: GOOG, dtype: int64

In [17]:
bycomp.sum().loc['FB']

Sales    11000
Name: FB, dtype: int64

In [18]:
df.groupby('Company').sum()

         Sales
Company
FB       11000
GOOG     13000
MSFT      6000

In [19]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [20]:
df. groupby('Company').max()

         Person  Sales
Company
FB       surine   6000
GOOG      julee   9000
MSFT     venesa   4000

In [21]:
df.groupby('Company').describe()

        Sales
        count    mean          std     min     25%     50%     75%     max
Company
FB        2.0  5500.0   707.106781  5000.0  5250.0  5500.0  5750.0  6000.0
GOOG      2.0  6500.0  3535.533906  4000.0  5250.0  6500.0  7750.0  9000.0
MSFT      2.0  3000.0  1414.213562  2000.0  2500.0  3000.0  3500.0  4000.0

In [22]:
df.groupby('Company').describe().transpose()

Company               FB         GOOG         MSFT
Sales count     2.000000     2.000000     2.000000
      mean   5500.000000  6500.000000  3000.000000
      std     707.106781  3535.533906  1414.213562
      min    5000.000000  4000.000000  2000.000000
      25%    5250.000000  5250.000000  2500.000000
      50%    5500.000000  6500.000000  3000.000000
      75%    5750.000000  7750.000000  3500.000000
      max    6000.000000  9000.000000  4000.000000

In [24]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count       2.000000
       mean     6500.000000
       std      3535.533906
       min      4000.000000
       25%      5250.000000
       50%      6500.000000
       75%      7750.000000
       max      9000.000000
Name: GOOG, dtype: float64